# YOLOv8s nền + sửa kiến trúc theo paper (P2/P3 head, bỏ P5; AMFF; DynamicHead)
task: detect
version: v8s
nc: 1  # hoặc số lớp của bạn
depth_multiple: 0.33
width_multiple: 0.50
anchors:  # anchor-free vẫn OK; thông số giữ nguyên
  - [10,13, 16,30, 33,23]
  - [30,61, 62,45, 59,119]
  - [116,90, 156,198, 373,326]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]         # P1/2
  - [-1, 1, Conv, [64, 3, 1]]
  - [-1, 3, C2f_CA, [64]]             # thay C2f->C2f_CA
  - [-1, 1, Conv, [128, 3, 2]]        # P2/4
  - [-1, 6, C2f_CA, [128]]
  - [-1, 1, Conv, [256, 3, 2]]        # P3/8
  - [-1, 6, C2f_CA, [256]]
  - [-1, 1, Conv, [512, 3, 2]]        # P4/16
  - [-1, 3, C2f_CA, [512]]
  # BỎ P5/32 theo paper (tập trung small/medium)

neck:
  # FPN-PAN rút gọn + AMFF hợp nhất P2/P3/P4
  - [6, 1, SPPF, [256, 5]]
  - [8, 1, Upsample, [None, 2]]          # P4 -> up
  - [[-1, 6], 1, Concat, [1]]            # cat(P4up, P3)
  - [-1, 3, C2f, [256]]

  - [-1, 1, Upsample, [None, 2]]         # -> P2
  - [[-1, 4], 1, Concat, [1]]            # cat(P3up, P2)
  - [-1, 3, C2f, [128]]

  # AMFF: hợp nhất 2 nhánh (P2,P3) hoặc (P2,P3,P4) tùy chọn
  - [[-1, 10, 8], 1, AMFF, [128]]        # AMFF(in_features: P2,P3,P4), out_c=128

head:
  # Dynamic Head (lite): thay DecoupledHead
  - [-1, 1, DynamicHeadLite, [nc, 128]]
